using System;
using System.Collections.Generic;
using System.Text;
using FlowerAssistant.Models;

namespace FlowerAssistant.Data
{
    public static class InfData
    {
        public static IList<FlowerInf> Infs { get; private set; }

        static InfData()
        {
            Infs = new List<FlowerInf>();

        //ЛУЧШИЕ УНИВЕРСАЛЬНЫЕ ГРУНТЫ ДЛЯ РАСТЕНИЙ
            Infs.Add(new FlowerInf
            {
                NameInf = "Почвогрунт COMPO SANA универсальный",
                PriceInf = "Универсальный грунт для растений",
                DetailsInf = "Средняя стоимость: 611 ₽"+"\n"+"\n" +
                "ДОСТОИНСТВА"+"\n"+
                "▲ Высокий процент приживаемости;"+"\n" +
                "▲ Однородная мягкая структура;" + "\n" +
                "▲ Фирменная добавка роста;" + "\n" +
                "▲ Контролируемая добыча сырья." + "\n" + "\n" +
                "НЕДОСТАТКИ"+"\n"+
                "▼ Не выявлены.",
               // ImageUrlInf = "1.jpg"
                ImageUrlInf = "https://www.1d.ru/upload/iblock/fc3/fc3836b294e0b8cb38dafa0049857e80.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт Terra Vita Живая земля универсальный",
                PriceInf = "Универсальный грунт для растений",
                DetailsInf = "Средняя стоимость: 344 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Ускорение роста и созревания плодов;" + "\n" +
                "▲ Восстановление скудных почв;" + "\n" +
                "▲ Повышение урожайности;" + "\n" +
                "▲ Оптимально подобранный состав." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://cdn1.ozone.ru/s3/multimedia-k/6291535328.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт Добрый помощник универсальный",
                PriceInf = "Универсальный грунт для растений",
                DetailsInf = "Средняя стоимость: 235 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Стимуляция корнеобразования;" + "\n" +
                "▲ Оптимальная влажность (65%);" + "\n" +
                "▲ Хорошая всхожесть рассады;" + "\n" +
                "▲ Природные минеральные вещества." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://valles.ru/upload/iblock/c92/c92ef359e3cc197d6ff93e7f58793e3d.jpg"
            });

            //ЛУЧШИЕ ГРУНТЫ ДЛЯ КОМНАТНЫХ РАСТЕНИЙ
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт ФАСКО цветочный",
                PriceInf = "Грунт для комнатных растений",
                DetailsInf = "Средняя стоимость: 406 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Универсальность применения;" + "\n" +
                "▲ Гигроскопичность;" + "\n" +
                "▲ Без патогенных микробов;" + "\n" +
                "▲ Мягкая консистенция." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://rezar.ru/upload/iblock/dc8/8sa4n3zblazxi0mmd9slywlqcvy3un52.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт PETER PEAT Линия Hobby для комнатных растений",
                PriceInf = "Грунт для комнатных растений",
                DetailsInf = "Средняя стоимость: 171 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Сбалансированный состав;" + "\n" +
                "▲ Без бактерий и сорняков;" + "\n" +
                "▲ Широкий спектр применения;" + "\n" +
                "▲ Подходит для требовтаельных цветов." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://ltbaza.ru/logo/thumb.php?id=3900.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт Veltorf для комнатных цветов универсальный",
                PriceInf = "Грунт для комнатных растений",
                DetailsInf = "Средняя стоимость: 132 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Для широкого ассортимента цветов;" + "\n" +
                "▲ Без мусора, инфекций и сорняков;" + "\n" +
                "▲ Высокая воздухопроницаемость;" + "\n" +
                "▲ Большая концентрация органики." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://cdn1.ozone.ru/s3/multimedia-e/6005331398.jpg"
            });

            //ЛУЧШИЕ ГРУНТЫ ДЛЯ ОВОЩНЫХ КУЛЬТУР
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт БИУД овощной",
                PriceInf = "Грунт для овощных культур",
                DetailsInf = "Средняя стоимость: 235 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ На основе биоорганическиз удобрений;" + "\n" +
                "▲ Защита корней от грибка и гнили;" + "\n" +
                "▲ Поддержание оптимальной влажности;" + "\n" +
                "▲ Тестирование в Центральном ботаническом саду." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://cdn.vseinstrumenti.ru/images/goods/sadovaya-tehnika/tovary-dlya-fermerov/1900752/1200x800/53719038.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт Фаско Крепыш для рассады",
                PriceInf = "Грунт для овощных культур",
                DetailsInf = "Средняя стоимость: 106 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Стимуляция роста корней;" + "\n" +
                "▲ Оптимальная влагоемкость;" + "\n" +
                "▲ Мощный питательный комплекс;" + "\n" +
                "▲ Подтвержденный тестами эффект." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://cdn1.ozone.ru/s3/multimedia-9/6059033565.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Грунт Morris Green для выращивания овощных культур",
                PriceInf = "Грунт для овощных культур",
                DetailsInf = "Средняя стоимость: 205 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Содержание органики - 98%;" + "\n" +
                "▲ Балан питательных веществ;" + "\n" +
                "▲ Макимальная приживаемость;" + "\n" +
                "▲ Без примесей и запаха." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Не выявлены.",
                ImageUrlInf = "https://cdn.qiosk.ru/55039789_1.jpg"
            });

        //ЛУЧШИЕ МИНЕРАЛЬНЫЕ УДОБРЕНИЯ ДЛЯ ЦВЕТОВ
            Infs.Add(new FlowerInf
            {
                NameInf = "Сад чудес «Радуга»",
                PriceInf = "Минеральное удобрение",
                DetailsInf = "Средняя стоимость: 149 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Превосходный состав;" + "\n" +
                "▲ Много хороших отзывов;" + "\n" +
                "▲ Безопасность;" + "\n" +
                "▲ Удобство использования;" + "\n" +
                "▲ Высокая эффективность." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Серьезных минусов нет.",
                ImageUrlInf = "https://mile.by/images/cache/_thumb_600x600xin_upload_iblock_231_1025958_1.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Удобрение Цветочное Forte 5 г Современные Технологии Качества",
                PriceInf = "Минеральное удобрение",
                DetailsInf = "Средняя стоимость: 331 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Доступная цена;" + "\n" +
                "▲ Удобство разведения;" + "\n" +
                "▲ Универсальное назначение;" + "\n" +
                "▲ Максимум микроэлементов;" + "\n" +
                "▲ Проверенное качество." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Нет.",
                ImageUrlInf = "https://agromer-storage-public.storage.yandexcloud.net/st/images/290/offers/db4c0df3-1376-4c9e-a72d-feadf64d3b67/3e942873f12dfa6457719e473c688d8f.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Нутрисол для цветущих растений",
                PriceInf = "Минеральное удобрение",
                DetailsInf = "Средняя стоимость: 105 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Идеальный баланс веществ;" + "\n" +
                "▲ Легко использовать;" + "\n" +
                "▲ Стимулирует появление бутонов." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Нет.",
                ImageUrlInf = "https://compasltd.com/pictures/product/middle/4623_middle.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Гилея «Ферти Микс»",
                PriceInf = "Минеральное удобрение",
                DetailsInf = "Средняя стоимость: 260 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Доступная стоимость;" + "\n" +
                "▲ Витаминизированный состав;" + "\n" +
                "▲ Экономичность." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Очень резкий запах.",
                ImageUrlInf = "https://фиалка.net/seeds/images/Dlya-komnatnyh-i-balkonnyh-rasteniy/Udobreniya-Fertimiks-rost-dlya-dekorativno-listvennyh-250ml-foto24906.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Удобрение для цветущих цветов «Агрикола»",
                PriceInf = "Минеральное удобрение",
                DetailsInf = "Средняя стоимость: 70 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Различные формы выпуска;" + "\n" +
                "▲ Без хлора;" + "\n" +
                "▲ Отличный результат;" + "\n" +
                "▲ Дешевизна." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Со временем порошок собирается в гранулы.",
                ImageUrlInf = "https://dobromart.com/files/faa/faa5bd6044f2f2f005c200e5b5ff2145.jpg"
            });

            //Органические удобрения
            Infs.Add(new FlowerInf
            {
                NameInf = "Удобрение органическое Сотка «Куриный помет» 700 г",
                PriceInf = "Органическое удобрение",
                DetailsInf = "Средняя стоимость: 1153 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Без резкого запаха;" + "\n" +
                "▲ Быстрый эффект;" + "\n" +
                "▲ Натуральный состав;" + "\n" +
                "▲ Доступность." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Требует опыта внесения.",
                ImageUrlInf = "https://umelets40.ru/d/432421_1.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Удобрение органическое конский навоз Оргавит 2 кг",
                PriceInf = "Органическое удобрение",
                DetailsInf = "Средняя стоимость: 300 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Богатый состав;" + "\n" +
                "▲ Повышение устойчивости к стрессу;" + "\n" +
                "▲ Не имеет запах;" + "\n" +
                "▲ Доступная цена." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Стоит дороже обычного навоза.",
                ImageUrlInf = "https://unisem.ru/upload/iblock/3ac/811kdbpe8ou6zmwarohuutp67t95i5tc.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Удобрение Зола древесная 1 кг",
                PriceInf = "Органическое удобрение",
                DetailsInf = "Средняя стоимость: 200 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Отличный состав;" + "\n" +
                "▲ Доступность;" + "\n" +
                "▲ Продление периода цветения." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Подходит не всем цветам.",
                ImageUrlInf = "https://smallcity.su/upload/iblock/8f2/8f2dde7a3e279f005fd1975f038220aa.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Сосновая кора ручной обработки фракция 4-8 в мешках 50л",
                PriceInf = "Органическое удобрение",
                DetailsInf = "Средняя стоимость: 1600 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Без вредных веществ;" + "\n" +
                "▲ Долговременный эффект;" + "\n" +
                "▲ Декоративная функция;" + "\n" +
                "▲ Распространенность в магазинах." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Дорого выходит на крупных участках.",
                ImageUrlInf = "https://cdn3.static1-sima-land.com/items/2507022/0/700.jpg?v=1512818006"
            });

            //внекорневые
            Infs.Add(new FlowerInf
            {
                NameInf = "Агровита для Цветов универсальное водорастворимое удобрение 100г",
                PriceInf = "Внекорневое удобрение",
                DetailsInf = "Средняя стоимость: 350 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Чистый состав;" + "\n" +
                "▲ Хорошо растворяется;" + "\n" +
                "▲ Без вредных веществ;" + "\n" +
                "▲ Демократичная цена." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Нет.",
                ImageUrlInf = "https://fancomstroy.ru/upload/iblock/3d8/hyj3bmqwbpbjjasa62k1elnrve36iusq/agrov100ovosh.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Буйские Удобрения «Цветочный рай.Чудо спрей», 500 мл",
                PriceInf = "Внекорневое удобрение",
                DetailsInf = "Средняя стоимость: 170 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Не нужно разводить;" + "\n" +
                "▲ Удобство использования;" + "\n" +
                "▲ Хватает на долгое время;" + "\n" +
                "▲ Быстрый результат." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Нет.",
                ImageUrlInf = "https://magazin-naturalist.ru/photos/catalog_photos/20384.jpg"
            });
            Infs.Add(new FlowerInf
            {
                NameInf = "Удобрение BONA FORTE для цветов",
                PriceInf = "Внекорневое удобрение",
                DetailsInf = "Средняя стоимость: 200 ₽" + "\n" + "\n" +
                "ДОСТОИНСТВА" + "\n" +
                "▲ Укрепление иммунитета;" + "\n" +
                "▲ Янтарная кислота и витамины в составе;" + "\n" +
                "▲ Не боится низких температур;" + "\n" +
                "▲ Большой выбор удобрений для конкретных культур." + "\n" + "\n" +
                "НЕДОСТАТКИ" + "\n" +
                "▼ Нет.",
                ImageUrlInf = "https://florissima-rnd.ru/upload/iblock/cbf/frnrf40trus3uknyk6izgkijj5rclidp/25fe2641_5a3b_11ea_a537_04d4c4029468_76a9b383_f365_11eb_a5b0_04d4c4029468.jpg"
            });
        }
    }
}
